
# -*- coding=utf-8 -*-
"""
주요 기능: 
    - 
    -

사용 방법: 
    - 


"""

##@@@ Package/Module
##============================================================

##@@ Built-In Package/Module
##------------------------------------------------------------
# import os, sys

##@@ External Package/Module
##------------------------------------------------------------
# from mp_util.basic import (
#     _create_folder as _create_folder, 
# )

##@@ User Package/Module
##------------------------------------------------------------
#sys.path.append(os.path.join(os.path.dirname(__file__), '.')) ## Note: 현재 디렉토리 기준 상대 경로 설정
# from basic import (
#     _create_folder, 
# )

##@@@ Constant/Varible
##============================================================

##@@ path, var
##------------------------------------------------------------
# CONST_1 = 1


##@@@ Private Function
##============================================================
def fun1(a, *args, **kwargs):
    """[summary]

    Args:
        a ([type]): [description]

    Returns:
        [type]: [description]
    
    Usages:
    
    """
    return r

##@@ util function 
##------------------------------------------------------------

##@@ sub function
##------------------------------------------------------------


##@@@ Public Class/function
##============================================================

##@@ 
##------------------------------------------------------------


##@@@ Main Function(테스트용)
##============================================================
if __name__ == "__main__":
    pass
    ## NOTE: 
